# Utilities

cask "rectangle"

cask "raycast"

cask "postman"

brew "gum"

brew "ag"

brew "zsh"

brew "gnupg"

brew "gnupg2"

brew "tmux"

brew "wget"

# Terminals
cask "iterm2"

# Browsers
cask "google-chrome"

# Communication
cask "slack"

# Video player
cask "vlc"

# Docker For Mac
cask "docker"

# Ruby tools
brew "readline"

brew "openssl@1.1"

# tree
brew "tree"

# jq
brew "jq"

# nmap
brew "nmap"

# nmap
brew "thefuck"

# gh
brew "gh"

# direnv
brew "direnv"


# coreutils
brew "coreutils"

# yq
brew "yq"

# Git
brew "git"
brew "git-filter-repo"

# Git Duet
tap "git-duet/tap"
brew "git-duet"


# Ripgrep
brew "ripgrep"

# asdf
brew "asdf"

# Neovim
brew "neovim"


tap "josephpage/jetpack-io"
brew "devbox"

brew "pam-reattach"

# reattach-to-user-namespace
brew "reattach-to-user-namespace"

cask "1password"

cask "1password-cli"

brew "watch"

brew "htop"

brew "rsync"

brew "ffmpeg"

cask "spotify"

cask "microsoft-teams"

cask "caffeine"

cask "git-credential-manager"

# Browsers
cask "obsidian"

cask "visual-studio-code"


tap "hashicorp/tap"
brew "hashicorp/tap/vault"
