# Utilities

cask "rectangle"

cask "raycast"

cask "postman"

brew "gum"

brew "ag"

brew "zsh"

brew "gnupg"


brew "tmux"

brew "wget"

# Terminals
cask "ghostty"

# Browsers
cask "google-chrome"

# Communication
cask "slack"

# Video player
cask "vlc"

# Docker For Mac
cask "docker-desktop"

# Ruby tools
brew "readline"

brew "openssl@3"

# tree
brew "tree"

# jq
brew "jq"

# nmap
brew "nmap"

# nmap
brew "thefuck"

# gh
brew "gh"

# direnv
brew "direnv"


# coreutils
brew "coreutils"

# yq
brew "yq"

# Git
brew "git"
brew "git-filter-repo"

# Git Duet
tap "git-duet/tap"
brew "git-duet"


# Ripgrep
brew "ripgrep"

# shellcheck
brew "shellcheck"

# uv - fast Python package manager
brew "uv"

# bun - JS runtime / package manager
brew "oven-sh/bun/bun"
tap "oven-sh/bun"

# node
brew "node"

# Neovim
brew "neovim"


tap "josephpage/jetpack-io"
brew "devbox"

brew "pam-reattach"

# reattach-to-user-namespace
brew "reattach-to-user-namespace"


brew "watch"

brew "htop"

brew "rsync"

brew "ffmpeg"

cask "spotify"

cask "git-credential-manager"

# Browsers
cask "obsidian"



tap "hashicorp/tap"
brew "hashicorp/tap/vault"
